---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarFailures.ClearPresentationForAllBarsInRebarSet
source: html/a7cf249e-dc6a-53bc-2872-99648fb5df89.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarFailures.ClearPresentationForAllBarsInRebarSet Property

All Bars in a Free Form Rebar Set have been hidden.

## Syntax (C#)
```csharp
public static FailureDefinitionId ClearPresentationForAllBarsInRebarSet { get; }
```